In [194]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [3]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocake'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocake
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]=None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

In [20]:
df

          0         1         2
0 -0.345014       NaN       NaN
1  0.874039       NaN       NaN
2 -0.072244       NaN  0.912866
3 -0.479927       NaN -0.953455
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [21]:
df.dropna()

          0         1         2
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [22]:
df.dropna(thresh = 2)  #怎么选择行？

          0         1         2
2 -0.072244       NaN  0.912866
3 -0.479927       NaN -0.953455
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [23]:
df.fillna(0) #直接将需要替换的值写在括号里

          0         1         2
0 -0.345014  0.000000  0.000000
1  0.874039  0.000000  0.000000
2 -0.072244  0.000000  0.912866
3 -0.479927  0.000000 -0.953455
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.345014  0.500000  0.000000
1  0.874039  0.500000  0.000000
2 -0.072244  0.500000  0.912866
3 -0.479927  0.500000 -0.953455
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [25]:
_ = df.fillna(0, inplace = True )

In [26]:
df

          0         1         2
0 -0.345014  0.000000  0.000000
1  0.874039  0.000000  0.000000
2 -0.072244  0.000000  0.912866
3 -0.479927  0.000000 -0.953455
4 -0.153293 -0.917591  1.167481
5  0.008107 -0.267517 -1.343179
6  0.193536 -2.179531 -0.015481

In [27]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.523272  0.173694 -0.335337
1 -0.183061 -0.115327 -0.002441
2 -0.729683       NaN  1.415204
3  0.908699       NaN -0.085350
4 -1.316326       NaN       NaN
5  0.182601       NaN       NaN

In [28]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.523272  0.173694 -0.335337
1 -0.183061 -0.115327 -0.002441
2 -0.729683 -0.115327  1.415204
3  0.908699 -0.115327 -0.085350
4 -1.316326 -0.115327 -0.085350
5  0.182601 -0.115327 -0.085350

In [29]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0 -0.523272  0.173694 -0.335337
1 -0.183061 -0.115327 -0.002441
2 -0.729683 -0.115327  1.415204
3  0.908699 -0.115327 -0.085350
4 -1.316326       NaN -0.085350
5  0.182601       NaN -0.085350

In [30]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [31]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],  #序列的链接用+  ?
                    'k2':[1,1,2,3,3,4,4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [36]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [38]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [39]:
lowercast = data['food'].str.lower()
lowercast

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data['animal'] = lowercast.map(meat_to_animal) #map为含有映射关系的字典型对象

In [41]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# 替换值

In [43]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [44]:
data.replace(-999.,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace([-999.,-1000],[0,np.nan])

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

In [46]:
data.replace({-999:0,-1000:np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

# 重命名轴索引

In [47]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio','New York','Colorada'],
                   columns = ['one','two','three','four'] )
data

          one  two  three  four
Ohio        0    1      2     3
New York    4    5      6     7
Colorada    8    9     10    11

In [48]:
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'NEW ', 'COLO'], dtype='object')

In [49]:
data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
New York    4    5      6     7
Colorada    8    9     10    11

In [50]:
data.rename(index = {'Ohio':'India'},
            columns= {'three':'peekaboo'})

          one  two  peekaboo  four
India       0    1         2     3
New York    4    5         6     7
Colorada    8    9        10    11

In [51]:
data.rename(index={'Ohio':'India'},inplace = True)
data

          one  two  three  four
India       0    1      2     3
New York    4    5      6     7
Colorada    8    9     10    11

# 离散化和面元划分

In [52]:
ages = [22,23,15,16,78,45,46,19,28,48,22,33,66]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18.0, 25.0], (18.0, 25.0], NaN, NaN, (60.0, 100.0], ..., (25, 35], (35, 60], (18, 25], (25, 35], (60, 100]]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
cats.codes

array([ 0,  0, -1, -1,  3,  2,  2,  0,  1,  2,  0,  1,  3], dtype=int8)

In [54]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [55]:
pd.value_counts(cats)

(18, 25]     4
(35, 60]     3
(60, 100]    2
(25, 35]     2
dtype: int64

In [56]:
pd.cut(ages,[18,26,36,61,100],right = False)

[[18.0, 26.0), [18.0, 26.0), NaN, NaN, [61.0, 100.0), ..., [26, 36), [36, 61), [18, 26), [26, 36), [61, 100)]
Length: 13
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [58]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, NaN, NaN, Senior, ..., YoungAdult, MiddleAged, Youth, YoungAdult, Senior]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [59]:
data = np.random.rand(20)
pd.cut(data,4,precision = 2)

[(0.021, 0.26], (0.26, 0.5], (0.74, 0.98], (0.5, 0.74], (0.021, 0.26], ..., (0.26, 0.5], (0.74, 0.98], (0.021, 0.26], (0.26, 0.5], (0.26, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.021, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [67]:
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats

[(0.00684, 0.716], (0.00684, 0.716], (0.00684, 0.716], (-3.13, -0.686], (-3.13, -0.686], ..., (-0.686, 0.00684], (0.00684, 0.716], (0.00684, 0.716], (0.00684, 0.716], (0.00684, 0.716]]
Length: 1000
Categories (4, interval[float64]): [(-3.13, -0.686] < (-0.686, 0.00684] < (0.00684, 0.716] < (0.716, 2.953]]

In [68]:
pd.value_counts(cats)

(0.716, 2.953]       250
(0.00684, 0.716]     250
(-0.686, 0.00684]    250
(-3.13, -0.686]      250
dtype: int64

In [74]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-3.13, -1.297]      100
(-1.297, 0.00684]    400
(0.00684, 1.361]     400
(1.361, 2.953]       100
dtype: int64

# 检验和过滤异常值

In [75]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046532     0.005346    -0.028033    -0.059905
std       1.016293     1.011533     1.017166     0.994109
min      -3.842820    -3.011031    -3.457454    -2.959244
25%      -0.723529    -0.703509    -0.725036    -0.729659
50%      -0.070782     0.024738    -0.039231    -0.069383
75%       0.600610     0.723547     0.663128     0.624684
max       3.477174     2.886396     3.073111     3.150870

In [76]:
col = data[2]
col[np.abs(col)>3]

264   -3.457454
796    3.073111
887   -3.308438
Name: 2, dtype: float64

In [80]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
264 -0.757872 -0.947938 -3.457454 -0.601983
490 -3.842820  0.865818  1.084991  0.716525
686  1.233412 -3.011031  0.002776 -0.188092
723  3.477174  0.021396 -1.846485  0.768503
796  0.060195  0.372884  3.073111 -0.557632
866 -0.062066 -0.076055  0.391901  3.150870
887  0.416336 -1.270076 -3.308438 -0.459580
911  3.312740 -2.150464 -0.073955 -0.365985

In [81]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046479     0.005357    -0.027340    -0.060056
std       1.010947     1.011500     1.014552     0.993633
min      -3.000000    -3.000000    -3.000000    -2.959244
25%      -0.723529    -0.703509    -0.725036    -0.729659
50%      -0.070782     0.024738    -0.039231    -0.069383
75%       0.600610     0.723547     0.663128     0.624684
max       3.000000     2.886396     3.000000     3.000000

In [82]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0 -1.0

# 排列和随机取样

In [86]:
data = pd.DataFrame(np.arange(5*4).reshape(4,5))
sampler = np.random.permutation(5)

In [87]:
sampler

array([3, 4, 1, 0, 2])

In [89]:
print(df)
df.take(sampler)

          0         1         2
0 -0.523272  0.173694 -0.335337
1 -0.183061 -0.115327 -0.002441
2 -0.729683       NaN  1.415204
3  0.908699       NaN -0.085350
4 -1.316326       NaN       NaN
5  0.182601       NaN       NaN

          0         1         2
3  0.908699       NaN -0.085350
4 -1.316326       NaN       NaN
1 -0.183061 -0.115327 -0.002441
0 -0.523272  0.173694 -0.335337
2 -0.729683       NaN  1.415204

In [91]:
df.sample(n = 3 )  #随机选取子集

          0         1         2
4 -1.316326       NaN       NaN
1 -0.183061 -0.115327 -0.002441
0 -0.523272  0.173694 -0.335337

In [95]:
choice = pd.Series([5,7,-1,6,4])
draw = choice.sample(n = 10,replace = True)
draw

2   -1
0    5
3    6
0    5
4    4
0    5
4    4
3    6
4    4
3    6
dtype: int64

# 计算指标/哑变量

In [100]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data1':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [105]:
dummies = pd.get_dummies(df['key'],prefix = 'key')

In [106]:
df_with_dummies = df[['data1']].join(dummies)

In [107]:
df_with_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [118]:
mnames = ['movie_id','title','genres']
movie = pd.read_table('datasets\movielens\movies.dat',sep ='::',header = None, names = mnames )
movie[:10]

D:\anaconda\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

D:\anaconda\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [119]:
all_genres = []
for x in movie.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [121]:
gen = movie.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [125]:
zero_matrix = np.zeros((len(movie),len(genres)))
dummies = pd.DataFrame(zero_matrix,columns = genres)
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [126]:
len(movie)

3883

In [127]:
len(genres)

18

In [133]:
for i ,gen in enumerate(movie.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [135]:
movie_windic = movie.join(dummies.add_prefix('Genre_'))

In [136]:
movie_windic.iloc[0]  #

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [138]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [140]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 字符串操作

In [145]:
val = 'a,b,    guido'
val.split(',')

['a', 'b', '    guido']

In [146]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [147]:
first,second,third = pieces
first + '::' + second + '::' +third

'a::b::guido'

In [149]:
'::'.join(pieces) #连接列表中的元素

'a::b::guido'

In [150]:
'a'in val

True

In [151]:
val.index(',')

1

In [158]:
val.find('b')

2

In [154]:
val.count(',')

2

In [155]:
val.replace('a','^')

'^,b,    guido'

In [159]:
val.upper()

'A,B,    GUIDO'

In [160]:
val.casefold()

'a,b,    guido'

In [161]:
import re

In [166]:
text = 'foo  bar\t  baz   \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [169]:
regex = re.compile('\s+')  #自己编译重用compile
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [170]:
regex.findall(text)

['  ', '\t  ', '   \t']

In [172]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [173]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [175]:
m = regex.search(text)
m

In [178]:
text[m.start():m.end()]

'dave@google.com'

In [180]:
print(regex.match(text))

None

In [181]:
print(regex.sub('PREDECATED',text))

Dave PREDECATED
Steve PREDECATED
Rob PREDECATED
Ryan PREDECATED

In [207]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' #r的意思？

In [208]:
regex = re.compile(pattern,flags = re.IGNORECASE)
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [209]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [210]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave Username:dave,Domain:google,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

# pandas的矢量化字符串函数

In [212]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [213]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [214]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [215]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [217]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [219]:
matches = data.str.match(pattern,flags = re.IGNORECASE) #两个元素的含义？？？
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [224]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [225]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [226]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [230]:
data.str[5:]

Dave     google.com
Steve    @gmail.com
Rob        mail.com
Wes             NaN
dtype: object